MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ16GS402/mcu.h
#define _STRIG1_STRGCMP7_POSITION                0x0000000A
#define _STRIG1_STRGCMP7_MASK                    0x00000400
#define _STRIG1_STRGCMP7_LENGTH                  0x00000001

#define _STRIG1_STRGCMP8_POSITION                0x0000000B
#define _STRIG1_STRGCMP8_MASK                    0x00000800
#define _STRIG1_STRGCMP8_LENGTH                  0x00000001

#define _STRIG1_STRGCMP9_POSITION                0x0000000C
#define _STRIG1_STRGCMP9_MASK                    0x00001000
#define _STRIG1_STRGCMP9_LENGTH                  0x00000001

#define _STRIG1_STRGCMP10_POSITION               0x0000000D
#define _STRIG1_STRGCMP10_MASK                   0x00002000
#define _STRIG1_STRGCMP10_LENGTH                 0x00000001

#define _STRIG1_STRGCMP11_POSITION               0x0000000E
#define _STRIG1_STRGCMP11_MASK                   0x00004000
#define _STRIG1_STRGCMP11_LENGTH                 0x00000001

#define _STRIG1_STRGCMP12_POSITION               0x0000000F
#define _STRIG1_STRGCMP12_MASK                   0x00008000
#define _STRIG1_STRGCMP12_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP10_POSITION               0x00000003
#define _PWMCAP1_PWMCAP10_MASK                   0x00000008
#define _PWMCAP1_PWMCAP10_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP11_POSITION               0x00000004
#define _PWMCAP1_PWMCAP11_MASK                   0x00000010
#define _PWMCAP1_PWMCAP11_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP12_POSITION               0x00000005
#define _PWMCAP1_PWMCAP12_MASK                   0x00000020
#define _PWMCAP1_PWMCAP12_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP13_POSITION               0x00000006
#define _PWMCAP1_PWMCAP13_MASK                   0x00000040
#define _PWMCAP1_PWMCAP13_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP14_POSITION               0x00000007
#define _PWMCAP1_PWMCAP14_MASK                   0x00000080
#define _PWMCAP1_PWMCAP14_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP15_POSITION               0x00000008
#define _PWMCAP1_PWMCAP15_MASK                   0x00000100
#define _PWMCAP1_PWMCAP15_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP16_POSITION               0x00000009
#define _PWMCAP1_PWMCAP16_MASK                   0x00000200
#define _PWMCAP1_PWMCAP16_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP17_POSITION               0x0000000A
#define _PWMCAP1_PWMCAP17_MASK                   0x00000400
#define _PWMCAP1_PWMCAP17_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP18_POSITION               0x0000000B
#define _PWMCAP1_PWMCAP18_MASK                   0x00000800
#define _PWMCAP1_PWMCAP18_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP19_POSITION               0x0000000C
#define _PWMCAP1_PWMCAP19_MASK                   0x00001000
#define _PWMCAP1_PWMCAP19_LENGTH                 0x00000001

#define _PWMCAP1_PWMCAP110_POSITION              0x0000000D
#define _PWMCAP1_PWMCAP110_MASK                  0x00002000
#define _PWMCAP1_PWMCAP110_LENGTH                0x00000001

#define _PWMCAP1_PWMCAP111_POSITION              0x0000000E
#define _PWMCAP1_PWMCAP111_MASK                  0x00004000
#define _PWMCAP1_PWMCAP111_LENGTH                0x00000001

#define _PWMCAP1_PWMCAP112_POSITION              0x0000000F
#define _PWMCAP1_PWMCAP112_MASK                  0x00008000
#define _PWMCAP1_PWMCAP112_LENGTH                0x00000001

#define _LEBCON1_LEB_POSITION                    0x00000003
#define _LEBCON1_LEB_MASK                        0x000003F8
#define _LEBCON1_LEB_LENGTH                      0x00000007

#define _LEBCON1_CLLEBEN_POSITION                0x0000000A
#define _LEBCON1_CLLEBEN_MASK                    0x00000400
#define _LEBCON1_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON1_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON1_FLTLEBEN_MASK                   0x00000800
#define _LEBCON1_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON1_PLF_POSITION                    0x0000000C
#define _LEBCON1_PLF_MASK                        0x00001000
#define _LEBCON1_PLF_LENGTH                      0x00000001

#define _LEBCON1_PLR_POSITION                    0x0000000D
#define _LEBCON1_PLR_MASK                        0x00002000
#define _LEBCON1_PLR_LENGTH                      0x00000001

#define _LEBCON1_PHF_POSITION                    0x0000000E
#define _LEBCON1_PHF_MASK                        0x00004000
#define _LEBCON1_PHF_LENGTH                      0x00000001

#define _LEBCON1_PHR_POSITION                    0x0000000F
#define _LEBCON1_PHR_MASK                        0x00008000
#define _LEBCON1_PHR_LENGTH                      0x00000001

#define _LEBCON1_LEB0_POSITION                   0x00000003
#define _LEBCON1_LEB0_MASK                       0x00000008
#define _LEBCON1_LEB0_LENGTH                     0x00000001

#define _LEBCON1_LEB1_POSITION                   0x00000004
#define _LEBCON1_LEB1_MASK                       0x00000010
#define _LEBCON1_LEB1_LENGTH                     0x00000001

#define _LEBCON1_LEB2_POSITION                   0x00000005
#define _LEBCON1_LEB2_MASK                       0x00000020
#define _LEBCON1_LEB2_LENGTH                     0x00000001

#define _LEBCON1_LEB3_POSITION                   0x00000006
#define _LEBCON1_LEB3_MASK                       0x00000040
#define _LEBCON1_LEB3_LENGTH                     0x00000001

#define _LEBCON1_LEB4_POSITION                   0x00000007
#define _LEBCON1_LEB4_MASK                       0x00000080
#define _LEBCON1_LEB4_LENGTH                     0x00000001

#define _LEBCON1_LEB5_POSITION                   0x00000008
#define _LEBCON1_LEB5_MASK                       0x00000100
#define _LEBCON1_LEB5_LENGTH                     0x00000001

#define _LEBCON1_LEB6_POSITION                   0x00000009
#define _LEBCON1_LEB6_MASK                       0x00000200
#define _LEBCON1_LEB6_LENGTH                     0x00000001

#define _PWMCON2_IUE_POSITION                    0x00000000
#define _PWMCON2_IUE_MASK                        0x00000001
#define _PWMCON2_IUE_LENGTH                      0x00000001

#define _PWMCON2_XPRES_POSITION                  0x00000001
#define _PWMCON2_XPRES_MASK                      0x00000002
#define _PWMCON2_XPRES_LENGTH                    0x00000001

#define _PWMCON2_CAM_POSITION                    0x00000002
#define _PWMCON2_CAM_MASK                        0x00000004
#define _PWMCON2_CAM_LENGTH                      0x00000001

#define _PWMCON2_DTC_POSITION                    0x00000006
#define _PWMCON2_DTC_MASK                        0x000000C0
#define _PWMCON2_DTC_LENGTH                      0x00000002

#define _PWMCON2_MDCS_POSITION                   0x00000008
#define _PWMCON2_MDCS_MASK                       0x00000100
#define _PWMCON2_MDCS_LENGTH                     0x00000001

#define _PWMCON2_ITB_POSITION                    0x00000009
#define _PWMCON2_ITB_MASK                        0x00000200
#define _PWMCON2_ITB_LENGTH                      0x00000001

